In [1]:
import pandas as pd

In [3]:
a = pd.Series(data=[10, 20, 'Y', 'N'], index=['eggs', 'apples', 'milk', 'bread'])
a

eggs      10
apples    20
milk       Y
bread      N
dtype: object

In [6]:
print(a['eggs'])
print()
print(a[['eggs']])
print()
print(a[['milk', 'bread']])

10

eggs    10
dtype: object

milk     Y
bread    N
dtype: object

In [10]:
print(a.loc[['milk']])
print()
print(a[[-1]])

milk    Y
dtype: object

bread    N
dtype: object

In [11]:
print(a.iloc[[1, 2]])

apples    20
milk       Y
dtype: object

In [7]:
a['eggs'] = 12
print(a)
print()
a[['eggs']] = 999
print(a)

eggs      12
apples    20
milk       Y
bread      N
dtype: object

eggs      999
apples     20
milk        Y
bread       N
dtype: object

In [16]:
print(a.drop('apples'))
a

eggs     12
milk      Y
bread     N
dtype: object

eggs      12
apples    20
milk       Y
bread      N
dtype: object

In [17]:
a.drop('apples', inplace=True)
a

eggs     12
milk      Y
bread     N
dtype: object

In [21]:
b = pd.Series(data=[1,2,3], index=['x', 'y', 'z'])
b + 10

x    11
y    12
z    13
dtype: int64

In [22]:
import numpy as np
np.sqrt(b)

x    1.000000
y    1.414214
z    1.732051
dtype: float64

In [24]:
b.iloc[0] + 100
b

x    1
y    2
z    3
dtype: int64

In [25]:
a * 2

eggs     24
milk     YY
bread    NN
dtype: object

In [26]:
x = pd.Series(data=[[1,2], [3,4]])

In [27]:
x

0    [1, 2]
1    [3, 4]
dtype: object

In [30]:
items = {
    "Bob": pd.Series(data=[1,2,3], index=['a', 'b', 'c']),
    "Alice": pd.Series(data=[4,5,6], index=['a', 'y', 'z'])
}
print(type(items))

<class 'dict'>

In [33]:
d = pd.DataFrame(items)
d

   Alice  Bob
a    4.0  1.0
b    NaN  2.0
c    NaN  3.0
y    5.0  NaN
z    6.0  NaN

In [34]:
d.values

array([[  4.,   1.],
       [ nan,   2.],
       [ nan,   3.],
       [  5.,  nan],
       [  6.,  nan]])

In [35]:
d.index

Index(['a', 'b', 'c', 'y', 'z'], dtype='object')

In [36]:
d.columns

Index(['Alice', 'Bob'], dtype='object')

In [39]:
new = pd.DataFrame(items, columns=['Bob'])
new

   Bob
a    1
b    2
c    3

In [41]:
x = pd.DataFrame(items, index=['a', 'x'])
x

   Alice  Bob
a    4.0  1.0
x    NaN  NaN

In [43]:
data = {'Integers' : [1,2,3],
        'Floats' : [4.5, 8.2, 9.6]}
e = pd.DataFrame(data, index=['a', 'b', 'c'])
e

   Floats  Integers
a     4.5         1
b     8.2         2
c     9.6         3

In [46]:
items2 = [{'bikes': 20, 'pants': 30, 'watches': 35}, 
          {'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5}]
itemF = pd.DataFrame(items2, index=['A', 'B'])
itemF

   bikes  glasses  pants  watches
A     20      NaN     30       35
B     15     50.0      5       10

In [22]:
itemF[['bikes']]

   bikes
A     20
B     15

In [20]:
itemF[['bikes', 'watches']]

   bikes  watches
A     20       35
B     15       10

In [23]:
itemF.loc[['A']]

   bikes  glasses  pants  watches
A     20      NaN     30       35

In [24]:
itemF['bikes']['A']

20

In [47]:
itemF['shirts'] = [1000, 200]
itemF

   bikes  glasses  pants  watches  shirts
A     20      NaN     30       35    1000
B     15     50.0      5       10     200

In [48]:
itemF['suits'] = itemF['shirts'] + itemF['pants']
itemF

   bikes  glasses  pants  watches  shirts  suits
A     20      NaN     30       35    1000   1030
B     15     50.0      5       10     200    205

In [49]:
new_item = pd.DataFrame([{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4}], index=['C'])
new_item

   bikes  glasses  pants  watches
C     20        4     30       35

In [53]:
itemF = itemF.append(new_item)

In [56]:
itemF['new_watches'] = itemF['watches'][1:]
itemF

   bikes  glasses  new_watches  pants  shirts   suits  watches
A     20      NaN          NaN     30  1000.0  1030.0       35
B     15     50.0         10.0      5   200.0   205.0       10
C     20      4.0         35.0     30     NaN     NaN       35

In [61]:
itemF.insert(7, 'shoes', [1,2,3])
itemF

   bikes  glasses  new_watches  pants  shirts   suits  watches  shoes
A     20      NaN          NaN     30  1000.0  1030.0       35      1
B     15     50.0         10.0      5   200.0   205.0       10      2
C     20      4.0         35.0     30     NaN     NaN       35      3

In [62]:
itemF.pop('new_watches')
itemF

   bikes  glasses  pants  shirts   suits  watches  shoes
A     20      NaN     30  1000.0  1030.0       35      1
B     15     50.0      5   200.0   205.0       10      2
C     20      4.0     30     NaN     NaN       35      3

In [66]:
print(itemF.drop(['watches', 'suits'], axis=1))
print(itemF)

   bikes  glasses  pants  shirts  shoes
A     20      NaN     30  1000.0      1
B     15     50.0      5   200.0      2
C     20      4.0     30     NaN      3
   bikes  glasses  pants  shirts   suits  watches  shoes
A     20      NaN     30  1000.0  1030.0       35      1
B     15     50.0      5   200.0   205.0       10      2
C     20      4.0     30     NaN     NaN       35      3

In [68]:
print(itemF.drop(['A'], axis=0))
print(itemF)

   bikes  glasses  pants  shirts  suits  watches  shoes
B     15     50.0      5   200.0  205.0       10      2
C     20      4.0     30     NaN    NaN       35      3
   bikes  glasses  pants  shirts   suits  watches  shoes
A     20      NaN     30  1000.0  1030.0       35      1
B     15     50.0      5   200.0   205.0       10      2
C     20      4.0     30     NaN     NaN       35      3

In [69]:
itemF.rename(columns={'bikes': 'hats'})

   hats  glasses  pants  shirts   suits  watches  shoes
A    20      NaN     30  1000.0  1030.0       35      1
B    15     50.0      5   200.0   205.0       10      2
C    20      4.0     30     NaN     NaN       35      3

In [70]:
itemF.rename(index={'C': 'Z', 'A': 'X'})

   bikes  glasses  pants  shirts   suits  watches  shoes
X     20      NaN     30  1000.0  1030.0       35      1
B     15     50.0      5   200.0   205.0       10      2
Z     20      4.0     30     NaN     NaN       35      3

In [71]:
itemF.set_index('bikes')

       glasses  pants  shirts   suits  watches  shoes
bikes
20         NaN     30  1000.0  1030.0       35      1
15        50.0      5   200.0   205.0       10      2
20         4.0     30     NaN     NaN       35      3

In [72]:
itemF

   bikes  glasses  pants  shirts   suits  watches  shoes
A     20      NaN     30  1000.0  1030.0       35      1
B     15     50.0      5   200.0   205.0       10      2
C     20      4.0     30     NaN     NaN       35      3

In [73]:
items3 = [{'bikes': 20, 'pants': 30, 'watches': 35, 'shirts': 15, 'shoes':8, 'suits':45},
{'watches': 10, 'glasses': 50, 'bikes': 15, 'pants':5, 'shirts': 2, 'shoes':5, 'suits':7},
{'bikes': 20, 'pants': 30, 'watches': 35, 'glasses': 4, 'shoes':10}]

In [75]:
store_items = pd.DataFrame(items3, index = ['store 1', 'store 2', 'store 3'])
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [76]:
store_items.isnull()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [77]:
store_items.isnull().sum()

bikes      0
glasses    1
pants      0
shirts     1
shoes      0
suits      1
watches    0
dtype: int64

In [81]:
store_items.isnull().sum().sum()

3

In [82]:
store_items.count()

bikes      3
glasses    2
pants      3
shirts     2
shoes      3
suits      2
watches    3
dtype: int64

In [83]:
store_items.count().sum()

18

In [84]:
store_items.dropna(axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 2     15     50.0      5     2.0      5    7.0       10

In [85]:
store_items.dropna(axis = 1)

         bikes  pants  shoes  watches
store 1     20     30      8       35
store 2     15      5      5       10
store 3     20     30     10       35

In [88]:
store_items.fillna(11111, inplace = True)
store_items

         bikes  glasses  pants   shirts  shoes    suits  watches
store 1     20  11111.0     30     15.0      8     45.0       35
store 2     15     50.0      5      2.0      5      7.0       10
store 3     20      4.0     30  11111.0     10  11111.0       35

In [99]:
store_items['glasses']['store 1'] = float('nan')
store_items['shirts']['store 3'] = float('nan')
store_items['suits']['store 3'] = float('nan')
store_items

/Users/vendhan/anaconda3/envs/aipnd/lib/python3.6/site-packages/ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  """Entry point for launching an IPython kernel.
/Users/vendhan/anaconda3/envs/aipnd/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/Users/vendhan/anaconda3/envs/aipnd/lib/python3.6/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [100]:
store_items.fillna(method = 'ffill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     20.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    30.0   10.0   10.0     35.0

In [101]:
store_items

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [102]:
store_items.fillna(method = 'backfill', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     30.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    10.0   10.0   35.0     35.0

In [103]:
store_items.fillna(method = 'backfill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20     50.0     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [105]:
store_items.fillna(method = 'ffill', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [106]:
store_items.interpolate(method = 'linear', axis = 0)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     2.0     10    7.0       35

In [107]:
store_items.interpolate(method = 'linear', axis = 1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1   20.0     25.0   30.0    15.0    8.0   45.0     35.0
store 2   15.0     50.0    5.0     2.0    5.0    7.0     10.0
store 3   20.0      4.0   30.0    20.0   10.0   22.5     35.0

In [108]:
type(store_items)

pandas.core.frame.DataFrame

In [109]:
store_items.shape

(3, 7)

In [110]:
store_items.isnull().any()

bikes      False
glasses     True
pants      False
shirts      True
shoes      False
suits       True
watches    False
dtype: bool

In [111]:
store_items.isnull()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1  False     True  False   False  False  False    False
store 2  False    False  False   False  False  False    False
store 3  False    False  False    True  False   True    False

In [112]:
store_items.head()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [113]:
store_items.tail()

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35
store 2     15     50.0      5     2.0      5    7.0       10
store 3     20      4.0     30     NaN     10    NaN       35

In [114]:
store_items.head(1)

         bikes  glasses  pants  shirts  shoes  suits  watches
store 1     20      NaN     30    15.0      8   45.0       35

In [115]:
store_items.describe()

,bikes,glasses,pants,shirts,shoes,suits,watches
count,3.000000,2.000000,3.000000,2.000000,3.000000,2.000000,3.000000
mean,18.333333,27.000000,21.666667,8.500000,7.666667,26.000000,26.666667
std,2.886751,32.526912,14.433757,9.192388,2.516611,26.870058,14.433757
min,15.000000,4.000000,5.000000,2.000000,5.000000,7.000000,10.000000
25%,17.500000,15.500000,17.500000,5.250000,6.500000,16.500000,22.500000
50%,20.000000,27.000000,30.000000,8.500000,8.000000,26.000000,35.000000
75%,20.000000,38.500000,30.000000,11.750000,9.000000,35.500000,35.000000
max,20.000000,50.000000,30.000000,15.000000,10.000000,45.000000,35.000000

In [116]:
store_items['watches'].describe()

count     3.000000
mean     26.666667
std      14.433757
min      10.000000
25%      22.500000
50%      35.000000
75%      35.000000
max      35.000000
Name: watches, dtype: float64

In [117]:
store_items.max()

bikes      20.0
glasses    50.0
pants      30.0
shirts     15.0
shoes      10.0
suits      45.0
watches    35.0
dtype: float64

In [118]:
store_items['shirts'].min()

2.0

In [119]:
store_items.corr()

            bikes  glasses     pants  shirts     shoes  suits   watches
bikes    1.000000     -1.0  1.000000     1.0  0.917663    1.0  1.000000
glasses -1.000000      1.0 -1.000000     NaN -1.000000    NaN -1.000000
pants    1.000000     -1.0  1.000000     1.0  0.917663    1.0  1.000000
shirts   1.000000      NaN  1.000000     1.0  1.000000    1.0  1.000000
shoes    0.917663     -1.0  0.917663     1.0  1.000000    1.0  0.917663
suits    1.000000      NaN  1.000000     1.0  1.000000    1.0  1.000000
watches  1.000000     -1.0  1.000000     1.0  0.917663    1.0  1.000000